group-reports/shahriar-3-1-tests/results-after-queue/disk-throughput-tuning-protocol-B/test-1.txt
read-sequentially-test-job: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=16
fio-3.7
Starting 1 process
read-sequentially-test-job: Laying out IO file (1 file / 10240MiB)

read-sequentially-test-job: (groupid=0, jobs=1): err= 0: pid=12206: Fri Jul 14 22:19:23 2023
   read: IOPS=5, BW=22.9MiB/s (24.0MB/s)(13.5GiB/602686msec)
    slat (usec): min=54, max=1668, avg=106.44, stdev=70.77
    clat (msec): min=32, max=5215, avg=2794.17, stdev=156.19
     lat (msec): min=33, max=5215, avg=2794.28, stdev=156.15
    clat percentiles (msec):
     |  1.00th=[ 2635],  5.00th=[ 2735], 10.00th=[ 2769], 20.00th=[ 2769],
     | 30.00th=[ 2769], 40.00th=[ 2802], 50.00th=[ 2802], 60.00th=[ 2802],
     | 70.00th=[ 2802], 80.00th=[ 2802], 90.00th=[ 2836], 95.00th=[ 2869],
     | 99.00th=[ 2970], 99.50th=[ 3071], 99.90th=[ 4665], 99.95th=[ 5000],
     | 99.99th=[ 5201]
   bw (  KiB/s): min= 8192, max=40960, per=99.91%, avg=23426.66, stdev=3636.15, samples=1201
   iops        : min=    2, max=   10, avg= 5.66, stdev= 0.92, samples=1201
  lat (msec)   : 50=0.03%, 100=0.03%, 500=0.06%, 750=0.03%, 1000=0.06%
  cpu          : usr=0.02%, sys=0.08%, ctx=3451, majf=0, minf=45
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=99.6%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3450,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=22.9MiB/s (24.0MB/s), 22.9MiB/s-22.9MiB/s (24.0MB/s-24.0MB/s), io=13.5GiB (14.5GB), run=602686-602686msec

Disk stats (read/write):
    drbd1: ios=17250/6, merge=0/0, ticks=48064344/240, in_queue=48064584, util=99.99%, aggrios=17250/11, aggrmerge=0/0, aggrticks=48078186/154, aggrin_queue=48078340, aggrutil=100.00%
    dm-0: ios=17250/11, merge=0/0, ticks=48078186/154, in_queue=48078340, util=100.00%, aggrios=17250/11, aggrmerge=0/0, aggrticks=48078610/154, aggrin_queue=48070081, aggrutil=100.00%
  vdb: ios=17250/11, merge=0/0, ticks=48078610/154, in_queue=48070081, util=100.00%